/*-------------------------------------------------------
【程序设计】
---------------------------------------------------------

题目：求s=a+aa+aaa+aa…aa(n个a),其中a，n由键盘输入。
      (例如2+22+222+2222+22222,此时n为5,a为2)

要求：循环控制变量用i，中间项存于变量t中。

-------------------------------------------------------*/

    /**********Program**********/
#include<stdio.h>
int main()
{

    int i,a,n,s=0,t=0;
	printf("请输入n,a:");
	scanf("%d", &n);
	scanf("%d", &a);

	for(i=1;i<=n;i++)
	{
		t=t*10+a;
	    s=s+t;
	}
	printf("s=%d", s);
	return 0;
}






    /**********  End  **********/

